---
kind: method
id: M:Autodesk.Revit.DB.Structure.AnalyticalElement.IsValidStructuralRole(Autodesk.Revit.DB.Structure.AnalyticalStructuralRole)
source: html/c53f8bf2-a819-c1c8-890b-f2571c087549.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalElement.IsValidStructuralRole Method

Checks whether the value set for Analytical Structural Role is valid for an Analytical Element.

## Syntax (C#)
```csharp
public bool IsValidStructuralRole(
	AnalyticalStructuralRole structuralRole
)
```

## Parameters
- **structuralRole** (`Autodesk.Revit.DB.Structure.AnalyticalStructuralRole`) - The value set to be verified.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration